/*************************************************************************
                           Mere  -  description
                             -------------------
    début                : 18 mars 2016
    copyright            : (C) Mere par Pierre Bayle et Ulysse Buonomo
    e-mail               : pierre.bayle@insa-lyon.fr
*************************************************************************/

//---------- Interface de la tâche <Mere> (fichier Mere.h) -------
#ifndef MERE_H
#define MERE_H

//------------------------------------------------------------------------
// Rôle de la tâche <Mere>
//
//
//------------------------------------------------------------------------

/////////////////////////////////////////////////////////////////  INCLUDE
//--------------------------------------------------- Interfaces utilisées

//------------------------------------------------------------- Constantes

//------------------------------------------------------------------ Types
 
//////////////////////////////////////////////////////////////////  PUBLIC
//---------------------------------------------------- Fonctions publiques
void Initialisation ();
// Mode d'emploi :
//
// Contrat :
//

void Moteur ();
// Mode d'emploi :
//
// Contrat :
//

void Destruction ();
// Mode d'emploi :
//
// Contrat :
//

#endif // MERE_H
